Merge pull request #39 from ShuvamRS/docs/final-readme
README finalize
